from django.core.management.base import BaseCommand
from app01.models import Vehicles, Age, Mileage


class Command(BaseCommand):

    def handle(self, *args, **options):
        print('заполнение справочников возраста и пробега')
        Vehicles.objects.all().delete()
        Age.objects.all().delete()
        Mileage.objects.all().delete()
        age_table = [(2022, "новая", "до 5 лет"),
                    (2021, "до 3 лет", "до 5 лет"),
                     (2020, "до 3 лет", "до 5 лет"),
                     (2019, "до 3 лет", "до 5 лет"),
                     (2018, "до 5 лет", "до 5 лет"),
                     (2017, "до 5 лет", "до 5 лет"),
                     (2016, "до 8 лет", "до 10 лет"),
                     (2015, "до 8 лет", "до 10 лет"),
                     (2014, "до 8 лет", "до 10 лет"),
                     (2013, "до 10 лет", "до 10 лет"),
                     (2012, "до 10 лет", "до 10 лет"),
                     (2011, "до 13 лет", "до 15 лет"),
                     (2010, "до 13 лет", "до 15 лет"),
                     (2009, "до 13 лет", "до 15 лет"),
                     (2008, "до 15 лет", "до 20 лет"),
                     (2007, "до 15 лет", "до 20 лет"),
                     (2006, "до 17 лет", "до 20 лет"),
                     (2005, "до 17 лет", "до 20 лет"),
                     (2004, "до 20 лет", "до 20 лет"),
                     (2003, "до 20 лет", "до 20 лет"),
                     (2002, "до 20 лет", "до 20 лет")
                     ]
        for year in age_table:
            Age.objects.create(production_year = year[0], age_small_scale = year[1], age_big_scale = year[2])

        mileage_table = ["до 10 тыс. км.", "до 20 тыс. км.", "до 30 тыс. км.", "до 40 тыс. км.",
                         "до 50 тыс. км.", "до 60 тыс. км.", "до 70 тыс. км.", "до 80 тыс. км.",
                         "до 90 тыс. км.", "до 100 тыс. км.", "до 110 тыс. км.", "до 120 тыс. км.",
                         "свыше 120 тыс. км."]
        for i in mileage_table:
            Mileage.objects.create(name=i)